
No problem @lunika  , if I can bring you a glimpse of a new user who installs without having much knowledge in Amazon services (we don't use Amazon at work). 😄 

Here are the returns after creation  
```
# bfe @ marsha in ~/marsha/src/aws [12:23:07] 
$ ./bin/state apply
aws_kms_key.state_key: Refreshing state... (ID: *********)
aws_dynamodb_table.terraform-state-locks: Refreshing state... (ID: terraform_state_locks)
aws_s3_bucket.state_bucket: Refreshing state... (ID: *********)

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  + aws_dynamodb_table.terraform-state-locks
      id:                                                                                                        <computed>
      arn:                                                                                                       <computed>
      attribute.#:                                                                                               "1"
      attribute.2068930648.name:                                                                                 "LockID"
      attribute.2068930648.type:                                                                                 "S"
      billing_mode:                                                                                              "PROVISIONED"
      hash_key:                                                                                                  "LockID"
      name:                                                                                                      "terraform_state_locks"
      point_in_time_recovery.#:                                                                                  <computed>
      read_capacity:                                                                                             "1"
      server_side_encryption.#:                                                                                  <computed>
      stream_arn:                                                                                                <computed>
      stream_label:                                                                                              <computed>
      stream_view_type:                                                                                          <computed>
      write_capacity:                                                                                            "1"

  + aws_s3_bucket.state_bucket
      id:                                                                                                        <computed>
      acceleration_status:                                                                                       <computed>
      acl:                                                                                                       "private"
      arn:                                                                                                       <computed>
      bucket:                                                                                                    "*********"
      bucket_domain_name:                                                                                        <computed>
      bucket_regional_domain_name:                                                                               <computed>
      force_destroy:                                                                                             "false"
      hosted_zone_id:                                                                                            <computed>
      region:                                                                                                    "eu-west-1"
      request_payer:                                                                                             <computed>
      server_side_encryption_configuration.#:                                                                    "1"
      server_side_encryption_configuration.0.rule.#:                                                             "1"
      server_side_encryption_configuration.0.rule.0.apply_server_side_encryption_by_default.#:                   "1"
      server_side_encryption_configuration.0.rule.0.apply_server_side_encryption_by_default.0.kms_master_key_id: "arn:aws:kms:eu-west-1:*********:key/*********"
      server_side_encryption_configuration.0.rule.0.apply_server_side_encryption_by_default.0.sse_algorithm:     "aws:kms"
      tags.%:                                                                                                    "1"
      tags.Name:                                                                                                 "terraform"
      versioning.#:                                                                                              "1"
      versioning.0.enabled:                                                                                      "true"
      versioning.0.mfa_delete:                                                                                   "false"
      website_domain:                                                                                            <computed>
      website_endpoint:                                                                                          <computed>


Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_s3_bucket.state_bucket: Creating...
  acceleration_status:                                                                                       "" => "<computed>"
  acl:                                                                                                       "" => "private"
  arn:                                                                                                       "" => "<computed>"
  bucket:                                                                                                    "" => "*********"
  bucket_domain_name:                                                                                        "" => "<computed>"
  bucket_regional_domain_name:                                                                               "" => "<computed>"
  force_destroy:                                                                                             "" => "false"
  hosted_zone_id:                                                                                            "" => "<computed>"
  region:                                                                                                    "" => "eu-west-1"
  request_payer:                                                                                             "" => "<computed>"
  server_side_encryption_configuration.#:                                                                    "" => "1"
  server_side_encryption_configuration.0.rule.#:                                                             "" => "1"
  server_side_encryption_configuration.0.rule.0.apply_server_side_encryption_by_default.#:                   "" => "1"
  server_side_encryption_configuration.0.rule.0.apply_server_side_encryption_by_default.0.kms_master_key_id: "" => "arn:aws:kms:eu-west-1:*********:key/*********"
  server_side_encryption_configuration.0.rule.0.apply_server_side_encryption_by_default.0.sse_algorithm:     "" => "aws:kms"
  tags.%:                                                                                                    "" => "1"
  tags.Name:                                                                                                 "" => "terraform"
  versioning.#:                                                                                              "" => "1"
  versioning.0.enabled:                                                                                      "" => "true"
  versioning.0.mfa_delete:                                                                                   "" => "false"
  website_domain:                                                                                            "" => "<computed>"
  website_endpoint:                                                                                          "" => "<computed>"
aws_dynamodb_table.terraform-state-locks: Creating...
  arn:                       "" => "<computed>"
  attribute.#:               "" => "1"
  attribute.2068930648.name: "" => "LockID"
  attribute.2068930648.type: "" => "S"
  billing_mode:              "" => "PROVISIONED"
  hash_key:                  "" => "LockID"
  name:                      "" => "terraform_state_locks"
  point_in_time_recovery.#:  "" => "<computed>"
  read_capacity:             "" => "1"
  server_side_encryption.#:  "" => "<computed>"
  stream_arn:                "" => "<computed>"
  stream_label:              "" => "<computed>"
  stream_view_type:          "" => "<computed>"
  write_capacity:            "" => "1"
aws_s3_bucket.state_bucket: Creation complete after 3s (ID: *********)
aws_dynamodb_table.terraform-state-locks: Creation complete after 7s (ID: terraform_state_locks)

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

state_bucket = *********
state_kms_key = arn:aws:kms:eu-west-1:*********:key/*********
state_locks = terraform_state_locks

# bfe @ marsha in ~/marsha/src/aws [12:24:57] 
$ make init
bin/terraform init

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.20"...
- Installing hashicorp/aws v3.21.0...
- Installed hashicorp/aws v3.21.0 (signed by HashiCorp)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
bin/shared-resources init

Initializing the backend...
Backend configuration changed!

Terraform has detected that the configuration specified for the backend
has changed. Terraform will now check for existing state in the backends.



Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Using previously-installed hashicorp/aws v3.21.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

# bfe @ marsha in ~/marsha/src/aws [12:27:18] 
$ ./bin/shared-resources destroy
Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes


Destroy complete! Resources: 0 destroyed.

# bfe @ marsha in ~/marsha/src/aws [12:27:48] 
$ ./bin/shared-resources apply -target aws_ecr_repository.marsha_lambda

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.marsha_lambda will be created
  + resource "aws_ecr_repository" "marsha_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "marsha/lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_lambda_arn = (known after apply)
  + ecr_lambda_url = (known after apply)


Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.

The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ecr_repository.marsha_lambda: Creating...
aws_ecr_repository.marsha_lambda: Creation complete after 0s [id=marsha/lambda]

Warning: Applied changes may be incomplete

The plan was created with the -target option in effect, so some changes
requested in the configuration may have been ignored and the output values may
not be fully updated. Run the following command to verify that no other
changes are pending:
    terraform plan

Note that the -target option is not suitable for routine use, and is provided
only for exceptional situations such as recovering from errors or mistakes, or
when Terraform specifically suggests to use it as part of an error message.


Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

ecr_lambda_arn = arn:aws:ecr:eu-west-1:*********:repository/marsha/lambda
ecr_lambda_url = *********.dkr.ecr.eu-west-1.amazonaws.com/marsha/lambda
```
**then I execute this step**
> The make init command will also create an ECR repository. Before going further you have to build and publish the lambda docker image. Unfortunately AWS doesn't allow to use a public image, so you have to host this one on a private ECR instance. Copy the output of the init command, you will use them in the next step.
> 
> Build and publish the lambda image
> For this step, we cooked a script to help you build, tag and deploy images. All the scripts are run from the marsha root directory.
> 
> 🔧 Before you go further, you need to create ./src/aws/env.d/lambda and replace the relevant values with your own. The ECR url is available in the shared_resources terraform output you copied earlier.
> 
> You have to successively run these commands :
> 
> Build the image:
> 
> $ ./bin/lambda build
> Tag the image:
> 
> $ ./bin/lambda tag
> And then publish it:
> 
> $ ./bin/lambda publish
> Apply all terraform plans

I understood that I have to create a lambda file in the src/aws/env.d/ folder, I assign it ECR=*********.dkr.ecr.eu-west-1.amazonaws.com/marsha/lambda recover from my output above.
But ./src/aws/env.d/lambda is in the ignore file, is there a reason? It's available in the top files marsha/env.d/lambda.dist
the script ./bin/lambda is in the top folder also marsha/bin/lambda
but if I try to modify the files at the top level and run the command here's what I get in return 
```
# bfe @ marsha in ~/marsha [13:59:43] 
/bin/lambda build
invalid argument ":production" for "-t, --tag" flag: invalid reference format
See 'docker build --help'.
```